In [1]:
import numpy as np
import pandas as pd

In [8]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
index
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

## `MultiIndex` turns tuples to index

In [9]:
index = pd.MultiIndex.from_tuples(index)

In [10]:
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           codes=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [11]:
pop = pop.reindex(index)

In [12]:
pop  # the first two columns of the Series representation show the multiple index values

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [13]:
pop[:, 2010] # multicolumn slicing

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [14]:
## MultiIndex as extra dimension

## `unstack()` convert a multiple indexed `Series` into a indexed `DataFrame`

In [15]:
pop_df = pop.unstack()

In [16]:
pop_df # stack()

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

## add another column in multiple index series

In [17]:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

## Methods of MultiIndex Creation

In [18]:
df = pd.DataFrame(np.random.rand(4, 2),
                 index = [['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                 columns = ['data1', 'data2'])

In [19]:
df

        data1     data2
a 1  0.649384  0.891714
  2  0.429084  0.206246
b 1  0.762272  0.526661
  2  0.352300  0.547847

## from dictionary to multiple index

In [20]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [23]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]]) # take each index as a factor and mark the element in every position

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [22]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [24]:
pd.MultiIndex.from_product([['a', 'b', 'c'], [1, 2, 3]])

MultiIndex(levels=[['a', 'b', 'c'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2], [0, 1, 2, 0, 1, 2, 0, 1, 2]])

## set the column names for index

In [25]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

## MultiIndex for columns

In [27]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])
columns

MultiIndex(levels=[['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
           codes=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]],
           names=['subject', 'type'])

In [33]:
# mock some data
data = np.round(np.random.randn(4, 6), 1)
data

array([[-0.1,  1.3, -2.3, -0.6,  2.5, -0.9],
       [-1.3, -0.7,  0.2,  2.4,  0.9, -0.9],
       [ 0.5,  2.5,  0.9, -0.5,  0.1,  1.1],
       [-0.2,  1.2,  0.1, -1.3, -1.2,  0.9]])

In [34]:
data[:, ::2] *= 10
data

array([[ -1. ,   1.3, -23. ,  -0.6,  25. ,  -0.9],
       [-13. ,  -0.7,   2. ,   2.4,   9. ,  -0.9],
       [  5. ,   2.5,   9. ,  -0.5,   1. ,   1.1],
       [ -2. ,   1.2,   1. ,  -1.3, -12. ,   0.9]])

5.0e

In [35]:
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      36.0  38.3  14.0  36.4  62.0  36.1
     2      24.0  36.3  39.0  39.4  46.0  36.1
2014 1      42.0  39.5  46.0  36.5  38.0  38.1
     2      35.0  38.2  38.0  35.7  25.0  37.9

In [36]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      14.0  36.4
     2      39.0  39.4
2014 1      46.0  36.5
     2      38.0  35.7

## Indexing and Slicing a MultiIndex

In [37]:
pop['California', 2000] # index multiple terms

33871648

In [38]:
pop.loc['California':'New York'] # partial slicing

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

## fancy indexing

In [39]:
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

## use tuple in indexing

In [40]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        36.0
      2        24.0
2014  1        42.0
      2        35.0
Name: (Bob, HR), dtype: float64

## explicit slicing

In [41]:
health_data.loc[pd.IndexSlice[:, 1], pd.IndexSlice[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      36.0  14.0  62.0
2014 1      42.0  46.0  38.0

## Sorted and unsorted indices

**Many of the `MultiIndex` slicing operations will fail if the index is not sorted**

In [43]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.702643
      2      0.045781
c     1      0.246055
      2      0.021791
b     1      0.582387
      2      0.208977
dtype: float64

In [44]:
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

## sort the index before slicing

In [45]:
data = data.sort_index()
data

char  int
a     1      0.702643
      2      0.045781
b     1      0.582387
      2      0.208977
c     1      0.246055
      2      0.021791
dtype: float64

## stacking and unstacking indices

In [47]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

## Index setting and resetting
trun the index into column

In [48]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [49]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

## Data Aggregations on Multi-Indices

In [50]:
data_mean = health_data.mean(level='year')
data_mean

subject   Bob        Guido         Sue
type       HR   Temp    HR  Temp    HR  Temp
year
2013     30.0  37.30  26.5  37.9  54.0  36.1
2014     38.5  38.85  42.0  36.1  31.5  38.0

In [51]:
data_mean.mean(axis=1, level='type')

type         HR   Temp
year
2013  36.833333  37.10
2014  37.333333  37.65